In [1]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [2]:
import pandas
import configparser
import psycopg2

In [3]:
config = configparser.ConfigParser()
config.read('configureir')


host = config['myaws']['host']
user = config['myaws']['user']
pswd = config['myaws']['pswd']
database = config['myaws']['database']

In [4]:
conn = psycopg2.connect (
                        host = host,
                        user = user,
                        password = pswd,
                        dbname = database
)

In [5]:
cur= conn.cursor()

In [6]:
sql_statement = '''
                select bathroom,bedroom 
                from house_price
                where bathroom > 2
                limit 5
                '''

In [7]:
cur.execute(sql_statement)

In [8]:
cur.fetchone()

(4.0, 4.0)

In [9]:
for result in cur.fetchall():
    print(result)

(4.0, 5.0)
(3.0, 2.0)
(3.0, 3.0)
(3.0, 4.0)

In [10]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

   bathroom  bedroom
0       4.0      4.0
1       4.0      5.0
2       3.0      2.0
3       3.0      3.0
4       3.0      4.0

# Q1

In [11]:
sql_statement = '''
                select * from student_grp14
                '''

In [12]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

,email,name,major
0,jones1ab@dukes.jmu.edu ...,Allen Jones ...,Intelligence Analysis ...
1,fitzpatrick31g@dukes.jmu.edu ...,Gina Fitzpatrick ...,Intelligence Analysis ...
2,johnsonN32@dukes.jmu.edu ...,Nathan Johnson ...,Geographic Science ...
3,zoft21l@dukes.jmu.edu ...,Lexi Zoft ...,Intelligence Analysis and International Affai...
4,smith1ab@dukes.jmu.edu ...,Alex Smith ...,Geograhic Science ...
5,smith2av ...,Aubs ...,Justice ...

# Q2

In [13]:
sql_statement = '''
               select 
cname,
count (semail)
from correlation_grp14
group by cname
order by count (semail) desc
limit 1
                '''

In [14]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

                                               cname  count
0  IA 210 - Introduction to Global Competitive In...      1

# Q3

In [15]:
sql_statement = '''
            select * from teacher_grp14
            full join course_grp14
            on teacher_grp14.email = course_grp14.temail
            '''

In [16]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

,email,name,office,name,room,temail
0,zulaufba@jmu.edu ...,Barry Zulauf ...,ISAT 110 ...,IA 480 :INTRO TO LAW ENFORCEMNT INTELLingence ...,ENGEO 2104 ...,zulaufba@jmu.edu ...
1,weixx@jmu.edu ...,Xuebin Wei ...,ISAT 112 ...,"IA 341 - Data Mining, Modeling and Knowledge D...",ENGEO 2014 ...,weixx@jmu.edu ...
2,taoqx@jmu.edu ...,Qingjiu (Tom) Tao ...,ENGEO 210 ...,IA 210 - Introduction to Global Competitive In...,ISAT 0236 ...,taoqx@jmu.edu ...
3,waltontr@jmu.edu ...,Timothy Walton ...,ISAT/CS 32 ...,IA 261 - HYPOTHESIS TESTING ...,ISAT 0150 ...,waltontr@jmu.edu ...
4,halepete@jmu.edu ...,Haley Peterson ...,HH 400 ...,IA 317: Counterterrorism ...,HH400 ...,halepete@jmu.edu ...
5,new_email ...,new_name1 ...,new_office1 ...,new_name ...,new_room ...,new_email ...
6,halepete@jmu.edu ...,Haley Peterson ...,HH 400 ...,"IA 340 - Data Mining, Modeling and Knowledge D...",ISAT 0336 ...,halepete@jmu.edu ...
7,paumarbey@jmu.edu\n ...,Paul Mabrey ...,Harrison Hall 1003 ...,None,None,None

## Q4

In [64]:
sql_statement = '''
select
teacher_grp14.name as tname,
count(course_grp14.name) as course_num
from teacher_grp14
full join course_grp14
on teacher_grp14.email = course_grp14.temail
group by teacher_grp14.name
order by count (teacher_grp14.name) desc
limit 1
                '''

In [65]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

                                               tname  course_num
0  Haley Peterson                                ...           2

# Q5

In [19]:
sql_insert_statement = '''
                    insert into teacher_grp14(email,name,office)
                    values('{}','{}','{}')
                    '''.format('new_email','new_name1','new_office1')
print(sql_insert_statement)

                    insert into teacher_grp14(email,name,office)
                    values('new_email','new_name1','new_office1')

In [20]:
sql_insert_statement = '''
                    insert into course_grp14(name,room,temail)
                    values('{}','{}','{}')
                    '''.format('new_name','new_room','new_email')
print(sql_insert_statement)

                    insert into course_grp14(name,room,temail)
                    values('new_name','new_room','new_email')

In [79]:
cur.execute(sql_insert_statement)

In [22]:
conn.commit()

In [23]:
df = pandas.read_sql_query("""select * from course_grp14""",conn)
df[:]

,name,room,temail
0,IA 480 :INTRO TO LAW ENFORCEMNT INTELLingence ...,ENGEO 2104 ...,zulaufba@jmu.edu ...
1,"IA 341 - Data Mining, Modeling and Knowledge D...",ENGEO 2014 ...,weixx@jmu.edu ...
2,IA 210 - Introduction to Global Competitive In...,ISAT 0236 ...,taoqx@jmu.edu ...
3,IA 261 - HYPOTHESIS TESTING ...,ISAT 0150 ...,waltontr@jmu.edu ...
4,IA 317: Counterterrorism ...,HH400 ...,halepete@jmu.edu ...
5,new_name ...,new_room ...,new_email ...
6,"IA 340 - Data Mining, Modeling and Knowledge D...",ISAT 0336 ...,halepete@jmu.edu ...

# Q6

In [41]:
sql_insert_statement = '''
update course_grp14
set temail = '{}'
where name = '{}'
                        '''.format('haltepete@jmu.edu', 'IA 340- Data Mining, Modeling and Knowledge Discovery')

In [42]:
cur.execute(sql_insert_statement)

In [43]:
conn.commit()

In [44]:
df = pandas.read_sql_query("""select * from course_grp14""",conn)
df[:]

,name,room,temail
0,IA 480 :INTRO TO LAW ENFORCEMNT INTELLingence ...,ENGEO 2104 ...,zulaufba@jmu.edu ...
1,"IA 341 - Data Mining, Modeling and Knowledge D...",ENGEO 2014 ...,weixx@jmu.edu ...
2,IA 210 - Introduction to Global Competitive In...,ISAT 0236 ...,taoqx@jmu.edu ...
3,IA 261 - HYPOTHESIS TESTING ...,ISAT 0150 ...,waltontr@jmu.edu ...
4,IA 317: Counterterrorism ...,HH400 ...,halepete@jmu.edu ...
5,new_name ...,new_room ...,new_email ...
6,"IA 340 - Data Mining, Modeling and Knowledge D...",ISAT 0336 ...,halepete@jmu.edu ...

In [75]:
sql_insert_statement = '''
delete from teacher_grp14
where email = '{}'

                        '''.format('teateaa@jmu.edu')

In [76]:
cur.execute(sql_insert_statement)

In [77]:
conn.commit()

In [78]:
df = pandas.read_sql_query("""select * from teacher_grp14""",conn)
df[:]

,email,name,office
0,zulaufba@jmu.edu ...,Barry Zulauf ...,ISAT 110 ...
1,weixx@jmu.edu ...,Xuebin Wei ...,ISAT 112 ...
2,waltontr@jmu.edu ...,Timothy Walton ...,ISAT/CS 32 ...
3,taoqx@jmu.edu ...,Qingjiu (Tom) Tao ...,ENGEO 210 ...
4,paumarbey@jmu.edu\n ...,Paul Mabrey ...,Harrison Hall 1003 ...
5,halepete@jmu.edu ...,Haley Peterson ...,HH 400 ...
6,new_email ...,new_name1 ...,new_office1 ...